#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.cloudavenue_tier0_vrfs.t0s: Reading...
data.cloudavenue_catalog_vapp_template.ubuntu: Reading...
data.cloudavenue_catalog_vapp_template.ubuntu: Read complete after 3s [id=urn:vcloud:vappTemplate:d5201583-4127-40ea-b479-cbdbffdab944]
data.cloudavenue_tier0_vrfs.t0s: Read complete after 6s [id="474baabd-09ea-5f2f-ad74-c4a3778fd16e"]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.cloudavenue_edgegateway_security_group.k3s will be read during apply
  # (config refers to values not yet known)
 <= data "cloudavenue_edgegateway_security_group" "k3s" {
      + description            = (known after apply)
      + edge_gateway_id        = (known after apply)
      + edge_gateway_name      = (known after apply)
      + id                     = (known after apply)
      + member_org_network_ids = (known after apply)
      + name                   = "all-nodes"
    }

  # data.tailscale_devices.k0s-cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "tailscale_devices" "k0s-cluster" {
      + devices     = (known after apply)
      + id          = (known after apply)
      + name_prefix = "k0s-cluster"
    }

  # cloudavenue_edgegateway.prod will be created
  + resource "cloudavenue_edgegateway" "prod" {
      + bandwidth      = 75
      + description    = (known after apply)
      + id             = (known after apply)
      + name           = (known after apply)
      + owner_name     = "PRODUCTION"
      + owner_type     = "vdc"
      + tier0_vrf_name = "prvrf01eocb0006205allsp01"
    }

  # cloudavenue_edgegateway_firewall.k0s will be created
  + resource "cloudavenue_edgegateway_firewall" "k0s" {
      + edge_gateway_id   = (known after apply)
      + edge_gateway_name = (known after apply)
      + id                = (known after apply)
      + rules             = [
          + {
              + action      = "ALLOW"
              + direction   = "OUT"
              + enabled     = true
              + id          = (known after apply)
              + ip_protocol = "IPV4"
              + logging     = false
              + name        = "K0s To Internet"
              + source_ids  = [
                  + (known after apply),
                ]
            },
          + {
              + action      = "ALLOW"
              + direction   = "OUT"
              + enabled     = true
              + id          = (known after apply)
              + ip_protocol = "IPV4"
              + logging     = false
              + name        = "K3s To Internet"
              + source_ids  = [
                  + (known after apply),
                ]
            },
          + {
              + action               = "ALLOW"
              + app_port_profile_ids = [
                  + "urn:vcloud:applicationPortProfile:4d8cc407-fe83-3a9f-af20-95dfe3a1e9a2",
                ]
              + destination_ids      = [
                  + (known after apply),
                ]
              + direction            = "IN"
              + enabled              = true
              + id                   = (known after apply)
              + ip_protocol          = "IPV4"
              + logging              = false
              + name                 = "From Internet to HTTP"
            },
          + {
              + action               = "ALLOW"
              + app_port_profile_ids = [
                  + "urn:vcloud:applicationPortProfile:9c8049b5-9820-36f9-b90c-ab8f462df3c6",
                ]
              + destination_ids      = [
                  + (known after apply),
                ]
              + direction            = "IN"
              + enabled              = true
              + id                   = (known after apply)
              + ip_protocol          = "IPV4"
              + logging              = false
              + name                 = "From Internet to HTTPS"
            },
        ]
    }

  # cloudavenue_edgegateway_nat_rule.out-k0s will be created
  + resource "cloudavenue_edgegateway_nat_rule" "out-k0s" {
      + description       = "out rule for K0S network"
      + edge_gateway_id   = (known after apply)
      + edge_gateway_name = (known after apply)
      + enabled           = true
      + external_address  = (known after apply)
      + firewall_match    = (known after apply)
      + id                = (known after apply)
      + internal_address  = "192.168.111.0/24"
      + name              = "out-k0s"
      + priority          = 0
      + rule_type         = "SNAT"
    }

  # cloudavenue_edgegateway_security_group.k0s will be created
  + resource "cloudavenue_edgegateway_security_group" "k0s" {
      + edge_gateway_id        = (known after apply)
      + edge_gateway_name      = (known after apply)
      + id                     = (known after apply)
      + member_org_network_ids = [
          + (known after apply),
        ]
      + name                   = "all-k0s-nodes"
    }

  # cloudavenue_network_routed.k0s will be created
  + resource "cloudavenue_network_routed" "k0s" {
      + description       = "K0S Network"
      + dns1              = "1.1.1.1"
      + dns2              = "8.8.4.4"
      + edge_gateway_id   = (known after apply)
      + edge_gateway_name = (known after apply)
      + gateway           = "192.168.111.254"
      + id                = (known after apply)
      + interface_type    = "INTERNAL"
      + name              = "K0S"
      + prefix_length     = 24
      + static_ip_pool    = [
          + {
              + end_address   = "192.168.111.20"
              + start_address = "192.168.111.10"
            },
        ]
    }

  # cloudavenue_publicip.k0s will be created
  + resource "cloudavenue_publicip" "k0s" {
      + edge_gateway_name = (known after apply)
      + id                = (known after apply)
      + public_ip         = (known after apply)
    }

  # cloudavenue_vapp.k0s-cluster will be created
  + resource "cloudavenue_vapp" "k0s-cluster" {
      + id    = (known after apply)
      + lease = {
          + runtime_lease_in_sec = 0
          + storage_lease_in_sec = 0
        }
      + name  = "K0S-Cluster"
      + vdc   = "PRODUCTION"
    }

  # cloudavenue_vapp_org_network.k0s-cluster will be created
  + resource "cloudavenue_vapp_org_network" "k0s-cluster" {
      + id           = (known after apply)
      + network_name = "K0S"
      + vapp_name    = "K0S-Cluster"
      + vdc          = "PRODUCTION"
    }

  # cloudavenue_vdc.production will be created
  + resource "cloudavenue_vdc" "production" {
      + billing_model         = "PAYG"
      + cpu_allocated         = 440000
      + cpu_speed_in_mhz      = 2200
      + description           = "Production VDC used for kubernetes"
      + disponibility_class   = "DUAL-ROOM"
      + id                    = (known after apply)
      + memory_allocated      = 500
      + name                  = "PRODUCTION"
      + service_class         = "HP"
      + storage_billing_model = "PAYG"
      + storage_profiles      = [
          + {
              + class   = "gold_r1"
              + default = false
              + limit   = 2048
            },
          + {
              + class   = "platinum3k_r1"
              + default = true
              + limit   = 8192
            },
          + {
              + class   = "platinum3k_r2"
              + default = false
              + limit   = 8192
            },
        ]
    }

  # local_file.k0sctl-config will be created
  + resource "local_file" "k0sctl-config" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "k0sctl-config.yaml"
      + id                   = (known after apply)
    }

  # null_resource.k0sctl will be created
  + resource "null_resource" "k0sctl" {
      + id       = (known after apply)
      + triggers = {
          + "always_run" = "timestamp()"
        }
    }

  # tailscale_tailnet_key.k0s will be created
  + resource "tailscale_tailnet_key" "k0s" {
      + created_at    = (known after apply)
      + ephemeral     = false
      + expires_at    = (known after apply)
      + id            = (known after apply)
      + invalid       = (known after apply)
      + key           = (sensitive value)
      + preauthorized = false
      + reusable      = true
    }

  # module.vm-k0s-cluster.data.tailscale_device.k0s[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tailscale_device" "k0s" {
      + addresses = (known after apply)
      + id        = (known after apply)
      + name      = (known after apply)
      + tags      = (known after apply)
      + user      = (known after apply)
      + wait_for  = "600s"
    }

  # module.vm-k0s-cluster.data.tailscale_device.k0s[1] will be read during apply
  # (config refers to values not yet known)
 <= data "tailscale_device" "k0s" {
      + addresses = (known after apply)
      + id        = (known after apply)
      + name      = (known after apply)
      + tags      = (known after apply)
      + user      = (known after apply)
      + wait_for  = "600s"
    }

  # module.vm-k0s-cluster.data.tailscale_device.k0s[2] will be read during apply
  # (config refers to values not yet known)
 <= data "tailscale_device" "k0s" {
      + addresses = (known after apply)
      + id        = (known after apply)
      + name      = (known after apply)
      + tags      = (known after apply)
      + user      = (known after apply)
      + wait_for  = "600s"
    }

  # module.vm-k0s-cluster.data.tailscale_device.k0s[3] will be read during apply
  # (config refers to values not yet known)
 <= data "tailscale_device" "k0s" {
      + addresses = (known after apply)
      + id        = (known after apply)
      + name      = (known after apply)
      + tags      = (known after apply)
      + user      = (known after apply)
      + wait_for  = "600s"
    }

  # module.vm-k0s-cluster.cloudavenue_vm.k0s[0] will be created
  + resource "cloudavenue_vm" "k0s" {
      + deploy_os = {
          + vapp_template_id = "urn:vcloud:vappTemplate:d5201583-4127-40ea-b479-cbdbffdab944"
        }
      + id        = (known after apply)
      + name      = (known after apply)
      + resource  = {
          + cpu_hot_add_enabled    = true
          + cpus                   = 2
          + cpus_cores             = 2
          + memory                 = 16384
          + memory_hot_add_enabled = true
          + networks               = [
              + {
                  + adapter_type       = "E1000E"
                  + connected          = true
                  + ip                 = "192.168.111.110"
                  + ip_allocation_mode = "MANUAL"
                  + is_primary         = true
                  + mac                = (known after apply)
                  + name               = "K0S"
                  + type               = "org"
                },
            ]
        }
      + settings  = {
          + affinity_rule_id               = (known after apply)
          + customization                  = {
              + allow_local_admin_password          = false
              + auto_generate_password              = false
              + change_sid                          = false
              + enabled                             = true
              + force                               = false
              + hostname                            = (known after apply)
              + join_domain                         = false
              + join_org_domain                     = false
              + must_change_password_on_first_login = false
              + number_of_auto_logons               = (known after apply)
            }
          + expose_hardware_virtualization = false
          + guest_properties               = {
              + "instance-id"    = (known after apply)
              + "local-hostname" = (known after apply)
              + "user-data"      = (sensitive value)
            }
          + os_type                        = (known after apply)
          + storage_profile                = "platinum3k_r1"
        }
      + state     = {
          + power_on = true
          + status   = (known after apply)
        }
      + vapp_id   = (known after apply)
      + vapp_name = "K0S-Cluster"
      + vdc       = "PRODUCTION"
    }

  # module.vm-k0s-cluster.cloudavenue_vm.k0s[1] will be created
  + resource "cloudavenue_vm" "k0s" {
      + deploy_os = {
          + vapp_template_id = "urn:vcloud:vappTemplate:d5201583-4127-40ea-b479-cbdbffdab944"
        }
      + id        = (known after apply)
      + name      = (known after apply)
      + resource  = {
          + cpu_hot_add_enabled    = true
          + cpus                   = 2
          + cpus_cores             = 2
          + memory                 = 16384
          + memory_hot_add_enabled = true
          + networks               = [
              + {
                  + adapter_type       = "E1000E"
                  + connected          = true
                  + ip                 = "192.168.111.111"
                  + ip_allocation_mode = "MANUAL"
                  + is_primary         = true
                  + mac                = (known after apply)
                  + name               = "K0S"
                  + type               = "org"
                },
            ]
        }
      + settings  = {
          + affinity_rule_id               = (known after apply)
          + customization                  = {
              + allow_local_admin_password          = false
              + auto_generate_password              = false
              + change_sid                          = false
              + enabled                             = true
              + force                               = false
              + hostname                            = (known after apply)
              + join_domain                         = false
              + join_org_domain                     = false
              + must_change_password_on_first_login = false
              + number_of_auto_logons               = (known after apply)
            }
          + expose_hardware_virtualization = false
          + guest_properties               = {
              + "instance-id"    = (known after apply)
              + "local-hostname" = (known after apply)
              + "user-data"      = (sensitive value)
            }
          + os_type                        = (known after apply)
          + storage_profile                = "platinum3k_r2"
        }
      + state     = {
          + power_on = true
          + status   = (known after apply)
        }
      + vapp_id   = (known after apply)
      + vapp_name = "K0S-Cluster"
      + vdc       = "PRODUCTION"
    }

  # module.vm-k0s-cluster.cloudavenue_vm.k0s[2] will be created
  + resource "cloudavenue_vm" "k0s" {
      + deploy_os = {
          + vapp_template_id = "urn:vcloud:vappTemplate:d5201583-4127-40ea-b479-cbdbffdab944"
        }
      + id        = (known after apply)
      + name      = (known after apply)
      + resource  = {
          + cpu_hot_add_enabled    = true
          + cpus                   = 2
          + cpus_cores             = 2
          + memory                 = 16384
          + memory_hot_add_enabled = true
          + networks               = [
              + {
                  + adapter_type       = "E1000E"
                  + connected          = true
                  + ip                 = "192.168.111.112"
                  + ip_allocation_mode = "MANUAL"
                  + is_primary         = true
                  + mac                = (known after apply)
                  + name               = "K0S"
                  + type               = "org"
                },
            ]
        }
      + settings  = {
          + affinity_rule_id               = (known after apply)
          + customization                  = {
              + allow_local_admin_password          = false
              + auto_generate_password              = false
              + change_sid                          = false
              + enabled                             = true
              + force                               = false
              + hostname                            = (known after apply)
              + join_domain                         = false
              + join_org_domain                     = false
              + must_change_password_on_first_login = false
              + number_of_auto_logons               = (known after apply)
            }
          + expose_hardware_virtualization = false
          + guest_properties               = {
              + "instance-id"    = (known after apply)
              + "local-hostname" = (known after apply)
              + "user-data"      = (sensitive value)
            }
          + os_type                        = (known after apply)
          + storage_profile                = "platinum3k_r1"
        }
      + state     = {
          + power_on = true
          + status   = (known after apply)
        }
      + vapp_id   = (known after apply)
      + vapp_name = "K0S-Cluster"
      + vdc       = "PRODUCTION"
    }

  # module.vm-k0s-cluster.cloudavenue_vm.k0s[3] will be created
  + resource "cloudavenue_vm" "k0s" {
      + deploy_os = {
          + vapp_template_id = "urn:vcloud:vappTemplate:d5201583-4127-40ea-b479-cbdbffdab944"
        }
      + id        = (known after apply)
      + name      = (known after apply)
      + resource  = {
          + cpu_hot_add_enabled    = true
          + cpus                   = 2
          + cpus_cores             = 2
          + memory                 = 16384
          + memory_hot_add_enabled = true
          + networks               = [
              + {
                  + adapter_type       = "E1000E"
                  + connected          = true
                  + ip                 = "192.168.111.113"
                  + ip_allocation_mode = "MANUAL"
                  + is_primary         = true
                  + mac                = (known after apply)
                  + name               = "K0S"
                  + type               = "org"
                },
            ]
        }
      + settings  = {
          + affinity_rule_id               = (known after apply)
          + customization                  = {
              + allow_local_admin_password          = false
              + auto_generate_password              = false
              + change_sid                          = false
              + enabled                             = true
              + force                               = false
              + hostname                            = (known after apply)
              + join_domain                         = false
              + join_org_domain                     = false
              + must_change_password_on_first_login = false
              + number_of_auto_logons               = (known after apply)
            }
          + expose_hardware_virtualization = false
          + guest_properties               = {
              + "instance-id"    = (known after apply)
              + "local-hostname" = (known after apply)
              + "user-data"      = (sensitive value)
            }
          + os_type                        = (known after apply)
          + storage_profile                = "platinum3k_r2"
        }
      + state     = {
          + power_on = true
          + status   = (known after apply)
        }
      + vapp_id   = (known after apply)
      + vapp_name = "K0S-Cluster"
      + vdc       = "PRODUCTION"
    }

  # module.vm-k0s-cluster.null_resource.delete_node[0] will be created
  + resource "null_resource" "delete_node" {
      + id       = (known after apply)
      + triggers = {
          + "ip"          = "192.168.111.110"
          + "name"        = (known after apply)
          + "private_key" = (sensitive value)
        }
    }

  # module.vm-k0s-cluster.null_resource.delete_node[1] will be created
  + resource "null_resource" "delete_node" {
      + id       = (known after apply)
      + triggers = {
          + "ip"          = "192.168.111.111"
          + "name"        = (known after apply)
          + "private_key" = (sensitive value)
        }
    }

  # module.vm-k0s-cluster.null_resource.delete_node[2] will be created
  + resource "null_resource" "delete_node" {
      + id       = (known after apply)
      + triggers = {
          + "ip"          = "192.168.111.112"
          + "name"        = (known after apply)
          + "private_key" = (sensitive value)
        }
    }

  # module.vm-k0s-cluster.null_resource.delete_node[3] will be created
  + resource "null_resource" "delete_node" {
      + id       = (known after apply)
      + triggers = {
          + "ip"          = "192.168.111.113"
          + "name"        = (known after apply)
          + "private_key" = (sensitive value)
        }
    }

  # module.vm-k0s-cluster.random_string.names[0] will be created
  + resource "random_string" "names" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.vm-k0s-cluster.random_string.names[1] will be created
  + resource "random_string" "names" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.vm-k0s-cluster.random_string.names[2] will be created
  + resource "random_string" "names" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.vm-k0s-cluster.random_string.names[3] will be created
  + resource "random_string" "names" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.vm-k0s-cluster.tailscale_device_authorization.k0s[0] will be created
  + resource "tailscale_device_authorization" "k0s" {
      + authorized = true
      + device_id  = (known after apply)
      + id         = (known after apply)
    }

  # module.vm-k0s-cluster.tailscale_device_authorization.k0s[1] will be created
  + resource "tailscale_device_authorization" "k0s" {
      + authorized = true
      + device_id  = (known after apply)
      + id         = (known after apply)
    }

  # module.vm-k0s-cluster.tailscale_device_authorization.k0s[2] will be created
  + resource "tailscale_device_authorization" "k0s" {
      + authorized = true
      + device_id  = (known after apply)
      + id         = (known after apply)
    }

  # module.vm-k0s-cluster.tailscale_device_authorization.k0s[3] will be created
  + resource "tailscale_device_authorization" "k0s" {
      + authorized = true
      + device_id  = (known after apply)
      + id         = (known after apply)
    }

  # module.vm-k0s-cluster.tailscale_device_key.k0s[0] will be created
  + resource "tailscale_device_key" "k0s" {
      + device_id           = (known after apply)
      + id                  = (known after apply)
      + key_expiry_disabled = true
    }

  # module.vm-k0s-cluster.tailscale_device_key.k0s[1] will be created
  + resource "tailscale_device_key" "k0s" {
      + device_id           = (known after apply)
      + id                  = (known after apply)
      + key_expiry_disabled = true
    }

  # module.vm-k0s-cluster.tailscale_device_key.k0s[2] will be created
  + resource "tailscale_device_key" "k0s" {
      + device_id           = (known after apply)
      + id                  = (known after apply)
      + key_expiry_disabled = true
    }

  # module.vm-k0s-cluster.tailscale_device_key.k0s[3] will be created
  + resource "tailscale_device_key" "k0s" {
      + device_id           = (known after apply)
      + id                  = (known after apply)
      + key_expiry_disabled = true
    }

Plan: 32 to add, 0 to change, 0 to destroy.

Warning: Bandwidth value is unknown, will be set to remaining bandwidth

  with cloudavenue_edgegateway.prod,
  on main.tf line 32, in resource "cloudavenue_edgegateway" "prod":
  32: resource "cloudavenue_edgegateway" "prod" {

Bandwidth defined to 75Mbps

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @dmicheneau, Action: `pull_request`*